### Pandas concat function

In [1]:
import pandas as pd

nepal_weather = pd.DataFrame({
    'city' : ['kathamndu', 'pokhara', 'biratnagar'],
    'temperature' : [26, 29, 32] ,
    'humidity' : [65, 60, 58]
})
nepal_weather

         city  humidity  temperature
0   kathamndu        65           26
1     pokhara        60           29
2  biratnagar        58           32

In [4]:
usa_weather = pd.DataFrame({
    'city' : ['chicago', 'new-york', 'california'],
    'temperature' : [21, 17, 23],
    'humidity' : [76,54,83]
})
usa_weather

         city  humidity  temperature
0     chicago        76           21
1    new-york        54           17
2  california        83           23

In [6]:
df = pd.concat([nepal_weather, usa_weather], ignore_index=True)  #ignore_index=True will increase index in order
df

         city  humidity  temperature
0   kathamndu        65           26
1     pokhara        60           29
2  biratnagar        58           32
3     chicago        76           21
4    new-york        54           17
5  california        83           23

###  Keeping Keys

In [7]:
df = pd.concat([nepal_weather, usa_weather], keys=["Nepal", "US"])
df

               city  humidity  temperature
Nepal 0   kathamndu        65           26
      1     pokhara        60           29
      2  biratnagar        58           32
US    0     chicago        76           21
      1    new-york        54           17
      2  california        83           23

In [8]:
df.loc["US"]

         city  humidity  temperature
0     chicago        76           21
1    new-york        54           17
2  california        83           23

### axis

In [10]:
temperature_df = pd.DataFrame({
    'city' : ['kathmandu', 'dharan', 'pokhara'],
    'temperature' : [23, 32, 29]
})
temperature_df

        city  temperature
0  kathmandu           23
1     dharan           32
2    pokhara           29

In [11]:
humidity_df = pd.DataFrame({
    'city' : ['kathmandu', 'dharan', 'pokhara'],
    'humidity' : [76, 65, 70]
})
humidity_df

        city  humidity
0  kathmandu        76
1     dharan        65
2    pokhara        70

#### axis=1

In [13]:
df = pd.concat([temperature_df, humidity_df], axis=1)  #axis =1 will not allow to form new rows insted shows in col.
df

        city  temperature       city  humidity
0  kathmandu           23  kathmandu        76
1     dharan           32     dharan        65
2    pokhara           29    pokhara        70

In [ ]:
# if the data is not in order we can use index argument in DataFrame function: index=[0,1,2] and similar in another 
#dataframe to match the previous index

## Adding Seris to Dataframe column

In [16]:
s = pd.Series(["Humid", "Dry", "Rain"], name="event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [17]:
df = pd.concat([temperature_df, s], axis=1)
df

        city  temperature  event
0  kathmandu           23  Humid
1     dharan           32    Dry
2    pokhara           29   Rain

# Pandas merge Dataframe

In [20]:
first_df = pd.DataFrame({
    'city' : ['kathmandu', 'dharan', 'pokhara'],
    'humidity' : [76, 65, 70]
})
first_df

        city  humidity
0  kathmandu        76
1     dharan        65
2    pokhara        70

In [19]:
second_df = pd.DataFrame({
    'city' : ['dharan', 'kathmandu', 'pokhara'],
    'temperature' : [32, 23, 28]
})
second_df

        city  temperature
0     dharan           32
1  kathmandu           23
2    pokhara           28

In [26]:
df = pd.merge(first_df, second_df, on="city")  ## like doing join in database
df

        city  humidity  temperature
0  kathmandu        76           23
1     dharan        65           32
2    pokhara        70           28

In [29]:
#ONlY COMMON DATA WILL BE SHOWN, IF FIRST DATAFRAME HAS EXTRA CITY THAT WILL NOT BE SHOWN AND VICE VERSA. THIS IS
#INNER JOIN, IF WE WANT TO GET ALL MATCHED OR UNMATCHED DATA WE NEED TO KEEP EXTRA ARGUMENT TO MERGE FUNCTION
# I.E.  how="outer"  outer join. how="inner" is by default.

# how="left" will come up with data from first dataframe with common data. 
# how="right" will come up with data from second dataframe with common data.

# indicator=True will give extra column _merge and displays where the data is from either both, left_only or 
# right_only

### If we have same column then they are appended as two columns

In [30]:
df1 = pd.DataFrame({
    'city' : ['dharan', 'kathmandu', 'pokhara'],
    'temperature' : [32, 23, 28]
})
df1

        city  temperature
0     dharan           32
1  kathmandu           23
2    pokhara           28

In [31]:
df2 = pd.DataFrame({
    'city' : ['dharan', 'kathmandu', 'pokhara'],
    'temperature' : [34, 25, 30]
})
df2

        city  temperature
0     dharan           34
1  kathmandu           25
2    pokhara           30

In [35]:
df = pd.merge(df1, df2, on="city", suffixes=("_left", "_right"))
df

        city  temperature_left  temperature_right
0     dharan                32                 34
1  kathmandu                23                 25
2    pokhara                28                 30